# GutterType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gutter..::..GutterType Property
Gutter Class See Also
---
Retrieves/set an object that represents the type of the Gutter.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GutterType GutterType { get; set; }
```

Visual Basic
---
```text
Public Property GutterType As GutterType
	Get
	Set
```

Visual C++
---
```text
public:
property GutterType^ GutterType {
	GutterType^ get ();
	void set (GutterType^ value);
}
```

# See Also
Gutter Class
Autodesk.Revit.DB.Architecture Namespace